{"pageProps":{"postData":{"id":"2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa","contentHtml":"<p>Quando falamos em engenheiros nosso espaço amostral é gigante. Temos vários exemplos de todas as áreas possíveis, mas o que acontece quando fazemos o recorte feminino e perguntamos acerca das engenheiras? As opções que lhe vêm na cabeça se reduzem muito? E agora, se te perguntassem sobre engenheiras negras? Saberia apontar alguma? A ideia desse artigo é, primeiramente, fazer você se questionar. Por que temos menos engenheiras mulheres e por que quando falamos de mulheres negras o número reduz ainda mais?</p>\n<p>Internalize estes questionamentos para refletir um pouco mais tarde, porque o que queremos, neste momento, é que você conheça a Aprille Ericsson.</p>\n<h2>A APOLLO PLANTOU UMA SEMENTE</h2>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa/images/2.png\" alt=\"Public school 199, Brooklyn NY, 1971-72 grade 3-1 photo\"></p>\n<p>Nascida no ano de 1963, em Bed Stuy, Brooklyn, na cidade de Nova York; Aprille sempre foi estudiosa, amante de esportes e de quadrinhos. A engenheira aponta alguns momentos que alavancaram seu entusiasmo pela ciência: o primeiro deles foi ao assistir o lançamento da missão Apollo, quando ainda era criança. A partir daí, uma sementinha foi plantada. Alguns anos depois, ganhou seu primeiro prêmio em uma feira de ciências e pouco mais tarde participou do MITES (Minority Introduction to Engineering &#x26; Science) no Massachusetts Institute of Technology (MIT), durante o verão no seu primeiro ano do Ensino Médio, foi neste programa onde teve seu primeiro contato com design de foguetes.</p>\n<h2>DO SONHO À REALIDADE</h2>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa/images/ericsson-aprille.jpg\" alt=\"Ericsson Aprille\"></p>\n<p>Aprille formou-se em Engenharia Aeronáutica e Aeroespacial no MIT em 1986, aos 23 anos. Pouco depois conquistou o seu mestrado e doutorado em Engenharia Mecânica, pela Universidade de Howard, tornando-se a primeira Doutora Afro-americana. Posteriormente, tornou-se a primeira mulher Afro-americana a receber o Phd em Engenharia no NASA Goddard Space Flight Center (GSFC).</p>\n<p>Há 29 anos trabalhando na NASA, Aprille já fez parte de diversas missões. No centro de vôo Espacial Goddard ela começou trabalhando na concepção de sistemas de controle. Passou a ser conhecida na NASA como a cientista dos foguetes, pois uma de suas funções é projetar e construir os sistemas que controlam as espaçonaves.</p>\n<h2>PROJETOS</h2>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa/images/LRO.jpg\" alt=\"Lunar Reconnaissance Orbiter\"></p>\n<p>Em um vídeo apresentado no World Science Festival, Aprille conta que seu projeto favorito é, até o momento, o Lunar Reconnaissance Orbiter (LRO), pois remete a quando estava na primeira série e teve a oportunidade ver o homem chegando a lua. Aprille trabalhou em todas as etapas de confecção do LRO, um satélite capaz de medir distâncias com extrema precisão. O LRO torna possível a criação de mapas tridimensionais da Lua, permitindo a visualização de crateras muito pequenas.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa/images/JWST.jpg\" alt=\"James Webb Space Telescope \"></p>\n<p>Ela também faz parte do projeto do James Webb Space Telescope (JWST), que possui previsão de lançamento para 2021. Espera-se que, caso tudo ocorra bem, o JWST colete dados que possam dar dicas sobre a velocidade de expansão da Via Láctea.</p>\n<h2>PREMIAÇÕES</h2>\n<p>Aprille já foi contemplada com diversos prêmios, entre eles, o prestigiado Washington Award, já conquistado anteriormente por Henry Ford, Neil Armstrong. Por mais de cem anos o prêmio vem reconhecendo engenheiras e engenheiros cujas realizações promovem a felicidade, o conforto e o bem estar da humanidade.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa/images/premio.jpg\" alt=\"Aprille\"></p>\n<blockquote>\n<p>Durante a premiação ela disse: \"Tive a oportunidade de falar com muitos jovens em todo o país e no mundo. Consigo inspirar os jovens e ter um impacto no futuro de engenheiros e cientistas. Quem poderia ter pedido um emprego melhor com um legado tão profundo? ”</p>\n</blockquote>\n<p>E aí? Ficou inspirada? Quer saber mais um pouco sobre a Aprille Ericsson e o seu trabalho? <a href=\"https://www.youtube.com/watch?v=LQ4jlgzOwHs&#x26;t=156s\">Assista à palestra da engenheira no TEDx Baltimore.</a></p>\n<p>Referências:</p>\n<p><a href=\"https://www.nsbp.org/nsbp-news/bhm-physics-profiles/2019-honorees/131-aprille-ericssonjackson\">https://www.nsbp.org/nsbp-news/bhm-physics-profiles/2019-honorees/131-aprille-ericssonjackson</a></p>\n<p><a href=\"https://usasciencefestival.org/people/draprilleericsson/\">https://usasciencefestival.org/people/draprilleericsson/</a></p>\n<p><a href=\"https://www.loc.gov/loc/lcib/0104/rocketeer.html\">https://www.loc.gov/loc/lcib/0104/rocketeer.html</a></p>\n<p><a href=\"https://www.youtube.com/watchtime_continue=8&#x26;v=DywbwPU7Zzw&#x26;feature=emb_logo\">https://www.youtube.com/watchtime_continue=8&#x26;v=DywbwPU7Zzw&#x26;feature=emb_logo</a></p>\n<p><a href=\"https://www.nasa.gov/feature/goddard/2016/nasa-goddard-s-aprille-ericsson-wins-prestigious-washington-award\">https://www.nasa.gov/feature/goddard/2016/nasa-goddard-s-aprille-ericsson-wins-prestigious-washington-award</a></p>\n<h3>Quer ficar ligado nos nossos novos artigos?</h3>\n<p>Cadastre-se para não perder mais!</p>\n","image":"/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa/images/1.jpg","link":"/corrente-alternativa/2020-07-22-aprille-ericsson-do-brooklyn-para-a-nasa","date":"2020-07-22","title":"Aprille Ericsson: Do Brooklyn para a NASA","authors":["moiraPrates"]}},"__N_SSG":true}