{"pageProps":{"postData":{"id":"2020-04-30-edith-clarke-pioneira-na-engenharia-eletrica","contentHtml":"<p>Quantas engenheiras que mudaram a história da ciência você conhece?</p>\n<p>Há tempos a engenharia é considerada uma área majoritariamente masculina e fazer sucesso nessa carreira como mulher nunca foi algo fácil, até nos dias atuais.</p>\n<p>Edwiges Hom’meil, Enedina Marques, Victória Rossetti, Hedy Lamarr, Emily Roebling, Aprille Ericsson, entre tantas outras, quebrando barreiras e preconceitos, foram pioneiras na engenharia e abriram espaço para a atuação de outras mulheres na área.</p>\n<p>E quando falamos de pioneirismo feminino na Engenharia Elétrica, não podemos deixar de mencionar <strong>Edith Clarke</strong>, um modelo de inspiração.</p>\n<p>Ela pode ter sido professora de Matemática e Física, estudante de Engenharia Civil, mas foi na Engenharia Elétrica que Edith Clarke fez seu nome como a primeira mulher a se formar engenheira eletricista no MIT, em 1918.</p>\n<h2>Antes da Engenharia Elétrica</h2>\n<p>“Eu sempre quis ser engenheira, mas sentia como se mulheres não devessem estudar coisas como engenharia.” — Edith Clarke ao The Dallas Morning News</p>\n<p>Seguir com os estudos em uma universidade já era algo incomum para uma mulher da época, mesmo assim, ela obteve seu bacharelado em Matemática e Astronomia pelo Vassar College, em Nova York.</p>\n<p>Após isso, trabalhou alguns anos como professora de Matemática e Física até, em 1911, ingressar no curso de Engenharia Civil, na Universidade de Wisconsin, Madison.</p>\n<p>Enquanto cursava Engenharia Civil, começou a trabalhar na <em>American Telephone and Telegraph</em> (AT&#x26;T) como Assistente de Informática. Era o que acontecia com mulheres que possuíam grande conhecimento na área de Matemática, acabavam virando os “computadores humanos”.</p>\n<p>Trabalhando na AT&#x26;T, ela teve contato com a Engenharia Elétrica e já se apaixonou. Assim, decidiu largar o curso de Engenharia Civil e ingressar no curso de Engenharia Elétrica do Instituto de Tecnologia de Massachusetts (MIT), se formando em 1918.</p>\n<h2>General Eletric e a Calculadora Clarke</h2>\n<p>Com dificuldade de arranjar emprego como engenheira eletricista, aceitou emprego na General Eletric (GE) como computador, não sendo reconhecida como engenheira por ser mulher até 1922, quando se tornou a primeira engenheira eletricista empregada nos EUA, na mesma empresa.</p>\n<p>Durante o período que trabalhava como computador, em 1921, desenvolveu a <a href=\"https://patents.google.com/patent/US1552113A/en\"><strong>Calculadora Clarke</strong></a>, calculadora gráfica usada para resolver problemas na linha de transmissão de energia. O dispositivo resolvia equações envolvendo corrente, tensão e impedância na linha até 10 vezes mais rápido que os métodos anteriores.</p>\n<p>Já com o emprego de engenheira, Edith lecionava aos engenheiros da GE e suas notas de aula se tornaram um livro <strong>“Circuit Analysis of A-C Power Systems”</strong>, publicado em 1943. Essa obra foi usada por muito tempo como referência para engenheiros e alunos de Engenharia Elétrica na área de potência.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-04-30-edith-clarke-pioneira-na-engenharia-eletrica/images/%E2%80%9CCircuit-Analysis-of-A-C-Power-Systems%E2%80%9D-volumes-1-e-2.png\" alt=\"“Circuit Analysis of A-C Power Systems”, volumes 1 e 2&#x22;\">\n“Circuit Analysis of A-C Power Systems”, volumes 1 e 2\"</p>\n<h2>Artigos no AIEE</h2>\n<p>Edith Clarke fez parte do American Institute of Electrical Engineers (AIEE), precursora do Institute of Electrical and Electronic Engineers (IEEE), e em 1926 foi a primeira mulher a apresentar um artigo ao Instituto, <a href=\"https://ieeexplore.ieee.org/document/5061206\"><strong>“Steady-State Stability in Transmission Systems Calculation by Means of Equivalent Circuits or Circle Diagrams”</strong></a>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-04-30-edith-clarke-pioneira-na-engenharia-eletrica/images/Edith-Clarke-Artigo.png\" alt=\"\"> Primeiro artigo publicado por Edith Clarke</p>\n<p>Mais tarde, ainda teve dois artigos premiados como melhor do ano pelo AIEE. Também foi a primeira mulher a receber o título de Fellow pelo mesmo Instituto, em 1948, título reservado para membros com realizações extraordinárias.</p>\n<h2>Primeira Professora de Engenharia Elétrica</h2>\n<p>Em 1947, após sua aposentadoria, a convite da Universidade do Texas, Austin, tornou-se a primeira professora de Engenharia Elétrica dos EUA. Enquanto professora, publicou o segundo volume do seu livro em 1950.</p>\n<p>Durante seu período como professora, ainda foi reconhecida pela Society of Women Engineers, ganhando o prêmio Society of Women Engineeers Achievement Award em 1954, principal prêmio da organização.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2020-04-30-edith-clarke-pioneira-na-engenharia-eletrica/images/Edith-Clarke-2.jpeg\" alt=\"\"></p>\n<p><a href=\"https://www.artstation.com/georgedoutsiopoulos\">Ilustração de George Doutsiopoulos</a></p>\n<h2>\"Não há uma demanda por engenheiras como há por médicas; Mas sempre há demanda por qualquer um que possa fazer um bom trabalho\" — Edith Clarke, 1948</h2>\n<hr>\n<h3>Quer ficar ligado nos nossos novos artigos?</h3>\n<p>Cadastre-se para não perder mais!</p>\n","image":"/corrente-alternativa/2020-04-30-edith-clarke-pioneira-na-engenharia-eletrica/images/Edith-Clarke.jpeg","link":"/corrente-alternativa/2020-04-30-edith-clarke-pioneira-na-engenharia-eletrica","date":"2020-04-30","title":"Edith Clarke - Pioneira na Engenharia Elétrica","authors":["marianaNascimento"]}},"__N_SSG":true}