{"pageProps":{"postData":{"id":"2021-08-25-shirley-ann-jackson-exemplo-maximo-para-mulheres-na-ciencia","contentHtml":"<p>Shirley Ann Jackson é um exemplo de persistência e luta. Durante sua vida, desafiou inúmeras barreiras raciais e de gênero, passando por todas de cabeça erguida e conquistando assim seu espaço na área ainda predominantemente masculina que é a Física. Se quer conhecer mais sobre a vida dessa incrível cientista que foi reconhecida pela Revista TIME como exemplo máximo para mulheres na ciência, continue lendo!</p>\n<h2>Ensino Médio e Graduação</h2>\n<p>Shirley nasceu em Washington D.C no dia 5 de novembro de 1946. Já na sua infância enfrentou sua primeira barreira: as escolas dos Estados Unidos ainda eram segregadas, assim ela só poderia frequentar escolas que possuíam uma qualidade de ensino inferior. Foi apenas em 1954 que houve a integração das escolas por decisão da Suprema Corte.</p>\n<p>Desde pequena foi empenhada na busca pelo conhecimento, se formando como oradora da turma no Ensino Médio da <em>Roosevelt High School</em> em 1964. No mesmo ano, ingressou no Instituto de Tecnologia de Massachusetts (MIT) como uma das poucas pessoas negras do instituto (na sua turma de calouros só havia mais uma mulher negra além da própria Shirley) e a única na área da Física Teórica. Jackson relatou que quando tentava se integrar com outras mulheres de sua turma, estas a excluíam e não a aceitavam em seus grupos de estudo.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-08-25-shirley-ann-jackson-exemplo-maximo-para-mulheres-na-ciencia/images/Black-Students-Union.jpg\" alt=\"Black Students Union logo\"></p>\n<p>Já em 1968, ano do assassinato de Martin Luther King, Jackson participou da criação do grupo <em>Black Students’ Union</em> (BSU), um grupo de estudantes negros que tem como objetivo incentivar a entrada de mais afrodescendentes no MIT. Percebendo que o instituto não faria uma campanha por conta própria para atrair esse público, o grupo formou uma força tarefa para recrutar estudantes em escolas predominantemente negras e obtiveram grande sucesso já que no ano seguinte mais de 50 estudantes entraram para a graduação, em comparação com os 3 a 5 dos anos anteriores. Segundo Shirley, \"E então envolveu um compromisso real por parte da administração e dos alunos, porque os alunos estavam realmente saindo e recrutando e gastando tempo nisso. Na verdade, foi um tanto controverso.\"</p>\n<p>Em 1973 conquistou seu Ph.D em Teoria das Partículas Elementares, se tornando a primeira mulher afro-americana a obter um doutorado no MIT, e a segunda mulher nos Estados Unidos a obter um doutorado em Física.</p>\n<h2>Trabalho e Conquistas</h2>\n<p>Por 15 anos, desde 1976, Shirley trabalhou na Bell Laboratories, no estado de New Jersey, nos EUA. Sua pesquisa durante esse período permitiu diversos avanços no setor de telecomunicações, tais como o fax portátil, o identificador de chamadas, a chamada de espera e fibras ópticas.</p>\n<p>Em 1995, foi nomeada, pelo então presidente Bill Clinton, presidente da <em>Nuclear Regulatory Commission</em> (NRC) - Comissão de Regulamentação Nuclear dos EUA. Em 1997 liderou a criação <em>International Nuclear Regulators Association</em> (INRA) - Associação Internacional de Reguladores Nucleares - cujo principal objetivo é a influência e aprimoramento da segurança nuclear.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-08-25-shirley-ann-jackson-exemplo-maximo-para-mulheres-na-ciencia/images/Rensselaer2.jpg\" alt=\"Rensselaer Polytechnic Institute\"></p>\n<p>Desde 1999 é a 18° presidente do Instituto Politécnico Rensselear (RPI) em New York e, em menos de 5 no cargo, conseguiu aumentar o número de docentes do sexo feminino em 34%, de 50 para 67. Suas ideias iniciais para transformar Rensselaer foram reunidas em um plano estratégico conhecido como <em>The Rensselaer Plan</em> (O Plano Rensselaer). Além disso, sua gestão foi marcada por uma triplicação de prêmios de pesquisa patrocinados e a contratação de quase 400 membros titulares do corpo docente, bem como avanços no currículo, um aumento nas bolsas de estudo, crescimento da pesquisa de graduação e inovações ousadas  na vida do(a) estudante, incluindo a premiada <em>First-Year Experience and Clustered Learning, Advocacy, and Support for Students</em> (CLASSE) -  Experiência de Primeiro Ano e Aprendizado em Cluster, Advocacia e Suporte para Estudantes.</p>\n<p>Em 2003 foi eleita presidente da <em>American Association for the Advancement of Science</em> (Associação Americana para o Avanço da Ciência), a maior sociedade científica geral do mundo. De 2009 a 2014, Jackson serviu no <em>President's Council of Advisors on Science and Technology</em> (PCAST) - Conselho de Assessores em Ciência e Tecnologia do Presidente - como copresidente do <em>President's Innovation and Technology Advisory Committee</em> (PITAC) - Comitê Consultivo de Inovação e Tecnologia do Presidente - auxiliando a Casa Branca na formulação de políticas nas áreas de ciência, tecnologia e inovação. Sendo então nomeada em 2014 pelo presidente da época Barack Obama como copresidente do <em>President's Intelligence Advisory Board</em> (Conselho Consultivo de Inteligência), trabalhando no cargo até 2017 assessorando o presidente em questões relacionadas à atividades de inteligência. Foi também o presidente Barack Obama que, em 2016, lhe entregou a Medalha Nacional de Ciências na área de Ciências Físicas.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-08-25-shirley-ann-jackson-exemplo-maximo-para-mulheres-na-ciencia/images/NationalMedalofScience.jpg\" alt=\"National Medal of Science\"></p>\n<h2>Shirley Ann Jackson</h2>\n<p>\"Eu daria este conselho a qualquer jovem inspirada pela possibilidade de descoberta e inovação: Não deixe que os outros definam quem você é. Defina-se. Não se deixe limitar pelo que os outros esperam de você, mas busque as estrelas com confiança.\"</p>\n<p>- Dr. Shirley Ann Jackson</p>\n<h2>Referências</h2>\n<ul>\n<li>MIT Black Students' Union: <a href=\"https://infinite.mit.edu/video/mit-black-students-union\">https://infinite.mit.edu/video/mit-black-students-union</a></li>\n<li>Revista TIME: <a href=\"http://content.time.com/time/magazine/article/0,9171,1032346-2,00.html\">http://content.time.com/time/magazine/article/0,9171,1032346-2,00.html</a></li>\n<li>Biografia pelo Instituto Rensselaer: <a href=\"https://president.rpi.edu/president-biography\">https://president.rpi.edu/president-biography</a></li>\n<li><a href=\"https://www3.unicentro.br/petfisica/2020/06/19/shirley-ann-jackson-1946/\">https://www3.unicentro.br/petfisica/2020/06/19/shirley-ann-jackson-1946/</a></li>\n<li><a href=\"https://decoresuavida.com.br/serie-mulheres-incriveis-2-shirley-ann-jackson/\">https://decoresuavida.com.br/serie-mulheres-incriveis-2-shirley-ann-jackson/</a></li>\n</ul>\n","image":"/corrente-alternativa/2021-08-25-shirley-ann-jackson-exemplo-maximo-para-mulheres-na-ciencia/images/cover.jpg","link":"/corrente-alternativa/2021-08-25-shirley-ann-jackson-exemplo-maximo-para-mulheres-na-ciencia","date":"2021-08-25","title":"Shirley Ann Jackson - Exemplo máximo para mulheres na ciência","authors":["marianaNascimento"]}},"__N_SSG":true}