{"pageProps":{"postData":{"id":"2021-02-09-tutorial-para-desenvolvimento-de-bots","contentHtml":"<p>Os <em>bots</em> ou robôs virtuais são aplicações computacionais programadas para realizar, de forma autônoma, uma tarefa previamente determinada. Esses programas podem ser usados em diversos contextos e para finalidades distintas. Com isso, essa publicação apresenta o desenvolvimento de um robô virtual capaz de facilitar inúmeras atividades cotidianas.</p>\n<p>Os <em>chatbots</em> constituem uma das aplicações mais comuns para os <em>bots</em>. Eles têm sido cada vez mais usados em lojas virtuais para atendimento dos usuários. Trata-se de um robô previamente parametrizado e programado para interagir com um cliente, simulando uma conversa humana por meio de um chat. Dessa forma, o atendimento às requisições é simplificado, trazendo benefícios aos vendedores e para seus clientes.</p>\n<p>O desenvolvimento de <em>chatbots</em> pode ser feito baseado em instruções pré-definidas ou por Inteligência Artificial (IA). O primeiro modo é mais limitado, pois apresenta um vocabulário restrito, aumentando as dificuldades de interação com o usuário. Por outro lado, um <em>chatbot</em> baseado em IA consegue estabelecer a comunicação de forma mais fluida, sem tantas limitações ou interferências humanas. Apesar do uso dos <em>bots</em> trazer questionamentos sobre a substituição do trabalho humano e o aumento do desemprego, essas ferramentas tendem a facilitar a execução das tarefas, evitando a realização de tarefas repetitivas.</p>\n<p>No contexto empresarial, a aplicação de <em>chatbots</em> pode trazer benefícios, como aumento na velocidade de atendimento, interações simultâneas, redução de custos, maior disponibilidade para a realização de atendimentos, entre outros. Além de trazer facilidades ao ambiente corporativo por meio da desburocratização e automatização de processos, essa ferramenta computacional pode ser usada para a realização de tarefas individuais de forma simples e gratuita. Assim, mesmo sem conhecimentos prévios a respeito de linguagens de programação, é possível desenvolver um <em>bot</em> capaz de enviar fotos, vídeos, textos, dados, entre outros.</p>\n<h2>SUMÁRIO</h2>\n<ol>\n<li>\n<p><a href=\"#i1\">CRIAÇÃO DE UM <em>BOT NO TELEGRAM</em></a></p>\n</li>\n<li>\n<p><a href=\"#i2\">USANDO O <em>INTEGROMAT</em></a></p>\n</li>\n<li>\n<p><a href=\"#i3\">CONECTANDO O BOT DO TELEGRAM AO SCENARIO</a></p>\n</li>\n<li>\n<p><a href=\"#i4\">CONECTANDO E CONFIGURANDO BLOCOS</a></p>\n</li>\n<li>\n<p><a href=\"#i5\">FORMATANDO OS DADOS</a></p>\n</li>\n<li>\n<p><a href=\"#i6\">ADICIONANDO O <em>GOOGLE CALENDAR</em></a></p>\n</li>\n<li>\n<p><a href=\"#i7\">AJUSTES FINAIS</a></p>\n</li>\n<li>\n<p><a href=\"#i8\">ETAPAS PARA O DESENVOLVIMENTO DA APLICAÇÃO</a></p>\n</li>\n<li>\n<p><a href=\"#i9\">CONCLUSÃO</a></p>\n</li>\n<li>\n<p><a href=\"#i10\">REFERÊNCIAS</a></p>\n</li>\n</ol>\n<h2>CRIAÇÃO DE UM <em>BOT NO TELEGRAM</em></h2>\n<p>Antes de começar a criar o robô virtual, é aconselhável definir qual o objetivo a ser alcançado através do <em>bot</em>. Para isso, é importante criar uma lista de funções que a aplicação deverá ser capaz de cumprir.</p>\n<p>Há muitas formas distintas para desenvolver um <em>bot</em>. O <em>Telegram</em> permite a criação de robôs virtuais de forma simples e rápida. Para facilitar esse procedimento, pode ser feito o uso da plataforma <em>Integromat</em> a qual apresenta interface gráfica de fácil utilização, capaz de conectar o <em>bot</em> a aplicativos e serviços, como <em>Facebook</em>, <em>Youtube</em>, <em>Discord</em>, <em>Tumblr</em>, <em>Instagram</em>, <em>Uber</em>, entre outros. Ressalta-se ainda que, com o uso dessa plataforma, não há a necessidade de codificação.</p>\n<p>O <em>bot</em> apresentado neste tutorial tem como função adicionar eventos na <em>Google</em> Agenda sem a necessidade de fazer o login nos serviços da <em>Google</em>. Desse modo, para realizar o cadastro de eventos e tarefas através do <em>bot</em>, é necessário lhe fornecer instruções. A fim de cumprir com tal requisito, utiliza-se o serviço de aplicação de mensagens instantâneas <em>Telegram</em>. Por meio desse robô virtual consegue-se simplificar a pequenos passos uma atividade que é, por vezes, tediosa. Sem mais delongas, vamos partir para a criação do <em>bot</em>!</p>\n<p><a href=\"images/postbot0.png\">Iniciando o uso do Botfather</a> Iniciando a comunicação com o <em>Botfather</em></p>\n<p>Digite “<em>BotFather</em>” na barra de pesquisa do <em>Telegram</em> e encontre a aplicação do <em>Telegram</em> responsável pelo desenvolvimento de <em>bots</em>. Quando abrir o <em>chat</em>, clique em “Começar” ou digite <em>/start</em>. Quando a conexão com o “<em>BotFather</em>” for iniciada, digite <em>/newbot</em> para criar o seu <em>bot</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot1.png\" alt=\"Print da tela com as configurações iniciais do bot\"> Configurações iniciais do <em>bot</em></p>\n<p>Após criar o <em>bot</em>, dê-lhe um nome e o nome de usuário. Por conseguinte, o <em>BotFather</em> lhe fornecerá um <em>Token</em>, responsável pela identificação do <em>bot</em>. Por último, copie o <em>token</em> e mantenha ele em algum lugar de fácil acesso.</p>\n<h2>USANDO O <em>INTEGROMAT</em></h2>\n<p>Antes de dar prosseguimento à etapa anterior, crie uma conta no <a href=\"https://www.integromat.com/\"><em>Integromat</em></a> , plataforma que permite a integração entre bots e diversos serviços. A primeira imagem que aparecerá depois do cadastro e login é a seguinte:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot2.png\" alt=\"Imagem que mostra a página inicial do Integromat\"> Página inicial do <em>Integromat</em></p>\n<p>Para criar uma nova aplicação, clique em <em>Create a new scenario</em>:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot3.png\" alt=\"Botão para iniciar a criação da aplicação.\">Posterior a isso, a tela apresentará as opções de serviços que podem ser utilizados. No caso dessa aplicação, selecione apenas o <em>Telegram Bot</em> e o <em>Google Calendar</em> usando a barra de pesquisa. Em seguida, clique em <em>Continue</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot4.png\" alt=\"Barra de pesquisa para os serviços a serem integrados com o bot\"> Barra de pesquisa para os serviços</p>\n<p>Após escolher o <em>Google Calendar</em> e o <em>Telegram</em>, clique em <em>Continue</em>. A primeira tela que aparecerá será a seguinte:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot5.png\" alt=\"Seleção do primeiro programa\"> Seleção do primeiro programa</p>\n<p>Como se pode visualizar na imagem acima, há um círculo com uma interrogação seguido de um relógio. Esse sistema será o <em>Trigger</em> ou gatilho, responsável por perceber mudanças no processo e, com isso, realizar uma ação.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot6.png\" alt=\"Escolha do programa a ser adicionado\"> Escolha do programa a ser adicionado</p>\n<p>No exemplo em questão, o gatilho será a mensagem enviada para o <em>bot</em> pelo chat do <em>Telegram</em>. Assim, o primeiro bloco a ser escolhido é o <em>Telegram Bot</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot7.png\" alt=\"Configuração inicial do bloco Telegram\"> Configuração inicial do bloco <em>Telegram</em></p>\n<p>A tela seguinte será como a mostrada na imagem acima, entre as opções presentes, pressione <em>Watch Updates</em>. Isso deve ser feito para criar uma aplicação que funcione sem interrupções indesejadas. Caso essa escolha não fosse feita, a aplicação funcionaria em um tempo previamente definido pelo usuário na seção do relógio.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot8.png\" alt=\"Configuração do bloco\"></p>\n<p>Esse bloco vai ativar o I_ntegromat_ sempre que houver alguma atualização.</p>\n<h2>CONECTANDO O BOT DO TELEGRAM AO SCENARIO</h2>\n<p>A partir desse momento, é necessário realizar a conexão entre a aplicação no <em>Integromat</em> e um <em>bot</em> existente no <em>Telegram</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot9.png\" alt=\"Iniciando a conexão entre o bot e o Integromat\"> Conectando o <em>bot</em> ao <em>Integromat</em></p>\n<p>Ao clicar nessa opção, inicia-se o processo de cadastramento do <em>bot</em> criado anteriormente no <em>BotFather</em>. Esse passo tem início ao clicar em <em>Add</em> e escolher um nome. Depois, deve-se clicar em <em>Add</em> novamente para adicionar uma conexão com o <em>bot</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot10.png\" alt=\"Adicionando o token do bot\"> Adicionando o <em>token</em> do <em>bot</em></p>\n<p>Em seguida, clique novamente no botão <em>Add</em> que aparecerá nas próximas duas janelas. Com isso, será possível definir o nome da conexão no espaço <em>Connection Name</em> e colocar o <em>Token</em>, obtido após a criação do <em>bot</em>, para que ele possa ser identificado.</p>\n<p>Posterior a isso, clica-se em <em>Save</em> para salvar a conexão estabelecida com o <em>bot</em>. Agora, é necessário criar ou deixar explícito para a aplicação a partir de qual evento ela deve atuar.</p>\n<h2>CONECTANDO E CONFIGURANDO BLOCOS</h2>\n<p>Para explicitar sobre qual evento a aplicação deve atuar, aproxime o cursor do mouse do primeiro módulo e clique em <em>Add another module</em>.</p>\n<p>O próximo passo será adicionar um outro módulo e conectar ao primeiro do <em>Telegram</em>. O próximo módulo a ser adicionado será o de <em>Tools</em> (canto inferior esquerdo da tela).</p>\n<p>Ao clicar em <em>Tools</em>, será aberta uma série de opções possíveis, como se pode visualizar na imagem abaixo. Será usado um bloco capaz de salvar valores em variáveis.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot11.png\" alt=\"Adicionando o bloco de ferramentas\"> Adicionando o bloco de ferramentas</p>\n<p>Como dito anteriormente, para fins de se armazenar o valor das variáveis, escolhe-se a opção Set <em>variable</em>. O passo seguinte busca criar um vetor com a mensagem do telegram enviada pelo usuário, de modo que os elementos do vetor serão separados por espaço, exemplo: Vamos super que a mensagem recebida pelo <em>bot</em> seja:</p>\n<p>festa 23/11/2020 15:40</p>\n<p>Os elementos que devem ser salvos em um vetor são:</p>\n<ul>\n<li>festa</li>\n<li>23/11/2020</li>\n<li>15:40</li>\n</ul>\n<p>Para fazer isso, conecte os dois blocos (Telegram ---> Tools):</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot12.png\" alt=\"Conexão entre o bloco Telegram Bot e o Tools\"> Conexão entre o bloco <em>Telegram Bot</em> e o <em>Tools</em></p>\n<p>Depois de conectar os dois blocos, faz-se necessário configurar o bloco <em>Tools</em> para que o objetivo almejado se concretize (separar as informações da mensagem em vetores separados por espaço).</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot13.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot14.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot15.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot16.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot17.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot18.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot19.png\" alt=\"Configurações do bloco das variáveis\"></p>\n<p>Por fim, altere o <em>Variable lifetime</em> de <em>One cycle</em> para <em>One execution</em> e renomeie o <em>Variable name</em> para Mensagem.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot20.png\" alt=\"Concluindo a configuração do bloco de ferramentas\"> Concluindo a configuração do bloco de ferramentas</p>\n<p>Uma vez terminada a configuração do bloco <em>Set variable</em> - <em>Tools</em>, é importante conectar esse conjunto a um bloco do <em>bot</em> do <em>Telegram</em> para que haja a percepção do efeito criado através do conjunto anterior.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/post21.png\" alt=\"Adição de bloco Telegram para realizar testes\"> Realizando teste</p>\n<p>Escolha a opção <em>Send Text Message or a Reply</em> para que o <em>bot</em> responda com uma mensagem de texto quando houver o gatilho.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot22.png\" alt=\"Conectando os blocos\"> Conectando os blocos</p>\n<p>O resultado é mostrado na figura acima após conectar o novo bloco do <em>Telegram Bot</em>. Para prosseguir com esse teste, configure o bloco de modo que se preencham os campos de <em>Chat ID</em> e <em>Text</em> como mostrado na figura abaixo:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot23.png\" alt=\"Configurando o bloco Telegram\"> Configurando o bloco <em>Telegram</em></p>\n<p>Com a configuração feita, aperte o <em>OK</em>, salve a aplicação e clique em <em>Run Once</em>. A partir desse momento, você pode enviar mensagens para o <em>bot</em> no <em>Telegram</em>. O <em>Run Once</em> não permite que o <em>bot</em> funcione para sempre, mas faz o <em>bot</em> funcionar somente uma vez e depois a aplicação para (recomendado para a fase de testes da aplicação).</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot24.png\" alt=\"Botão para execução\"></p>\n<p>Uma vez clicado, o funcionamento pode ser visto no chat do <em>bot</em> no <em>Telegram</em>, digitando um texto no seguinte formato:</p>\n<p>/nomeDoEvento data hora</p>\n<p>Caso ainda tenha dúvidas, siga o modelo mostrado na figura abaixo:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot25-1.png\" alt=\"Testando a comunicação com o bot\"></p>\n<p>Assim, percebe-se como o bot respondeu conforme as configurações feitas previamente.(O robô virtual está salvando o primeiro elemento “cortarCabelo”, o segundo elemento “05/02/2021” e o terceiro “14:00h”, todos separados por vírgula.</p>\n<p>O próximo passo é separar essa informação/elemento e salvar numa variável. O primeiro elemento é o nome do evento e, para separar e salvar em uma variável, o seguinte procedimento deve ser seguido:</p>\n<p>É necessário adicionar um <em>Set variable</em>, o qual pode ser encontrado na aba de <em>Tools</em>, logo após o primeiro que já havia sido construído nessa aplicação. Para desfazer as conexões entre os blocos, clique com o botão direito e pressione <em>unlink</em>. Então, mova blocos e os ajuste desta maneira:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot26.png\" alt=\"Disposição dos blocos\"> Disposição dos blocos</p>\n<p>Com a disposição dos blocos ajustada, é necessário configurar esse novo bloco <em>Set variable</em> - <em>Tools</em>. Para isso, preencha-o com as informações presentes na figura abaixo.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot27.png\" alt=\"Configurando novo bloco de ferramentas\"> Configurando novo bloco de ferramentas</p>\n<p>Por meio desse bloco, cria-se uma variável que armazena o valor resultante do primeiro elemento da informação anterior, ou seja, nomedoEvento. Caso haja dúvidas em relação a função <em>slice</em>, consulte a <a href=\"https://support.integromat.com/hc/en-us/articles/360005771833-Array-Function\">referência</a> <a href=\"https://support.integromat.com/hc/en-us/articles/360005771833-Array-Function\"></a> disponibilizada pelo suporte do próprio <em>Integromat</em>.</p>\n<p>A função <em>slice</em> recebe como parâmetro uma <em>string</em> (palavra) e os índices que demarcam qual elemento a função deve armazenar. Como inicialmente só se deseja salvar o nome do evento, faz-se uso dos números 0 e 1. Isso se deve ao fato de que o elemento de índice zero é o nomedoEvento, o primeiro elemento é a data e o segundo elemento é o horário.</p>\n<p>Antes de prosseguir para o próximo passo, a aplicação será testada. O último bloco do <em>Telegram Bot</em> deve ser configurado de modo que o campo <em>Text</em> apresente a seguinte informação:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot28.png\" alt=\"Configuração de texto do bloco Telegram Bot\"> Configuração de texto do bloco <em>Telegram Bot</em></p>\n<p>Depois dessa configuração, salve a aplicação e aperte o botão <em>Run Once</em> de novo. Posteriormente, envie a mensagem anterior “/cortarCabelo 05/02/2021 14:00” ao <em>bot</em> e, se aparecer uma caixa de diálogo, clique em <em>listen for new</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot29.png\" alt=\"Testando a comunicação com o bot\"></p>\n<p>Após o entendimento sobre como extrair o primeiro valor, pode-se repetir o processo, de forma análoga, para extrair o segundo e o terceiro. Para isso, criam-se mais dois blocos <em>Set Variable</em> de modo que a disposição física da nossa aplicação fique conforme a figura abaixo no <em>Integromat</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot30.png\" alt=\"Disposição dos serviços\"> Disposição dos serviços</p>\n<p>Para configurar os blocos <em>Set Variable - Tools</em> seguintes, segue-se o mesmo procedimento realizado para armazenar o primeiro valor:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot31.png\" alt=\"Configuração do terceiro bloco de ferramentas\"> Configuração do terceiro bloco de ferramentas</p>\n<p>Em dataEvento colocamos os parâmetros 1 e 2 para armazenar a informação da data.</p>\n<p>E, no último, colocam-se o 2 e o 3, objetivando armazenar a informação do horário do evento.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot32.png\" alt=\"Configuração do quarto bloco de ferramentas\"> Configuração do quarto bloco de ferramentas</p>\n<p>Ao finalizar a configuração de todos os blocos <em>Set Variable - Tools</em>, é necessário configurar novamente o bloco do <em>bot</em>. Alterando o conteúdo do campo <em>Text</em> como mostrado na figura a seguir:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot33.png\" alt=\"Configuração do último bloco Telegram\"> Configuração do último bloco <em>Telegram Bot</em></p>\n<p>Em seguida, salve a aplicação, aperte <em>Run Once</em> e inicie a conversa com o <em>bot</em> pelo <em>chat</em> do <em>Telegram</em>.</p>\n<p>A resposta esperada ao enviar “/cortarCabelo 05/02/2021 14:00” é a seguinte:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/post34.png\" alt=\"Estabelecendo comunicação com o bot\"></p>\n<p>Isso demonstra que cada informação foi salva por três variáveis distintas. Ou seja, a mensagem foi subdividida em partes distintas as quais foram armazenadas em variáveis diferentes.</p>\n<p>Antes de prosseguir, percebe-se que já foram feitas as seguintes etapas: configurou-se a aplicação para obter a mensagem fornecida pelo usuário através do <em>chat</em> do <em>Telegram</em>, armazenando-a em blocos separados (nome do evento, data, horário).</p>\n<p>Por último, após separar as informações, extraem-se os seus respectivos valores. Nesse momento, com o tratamento dos dados envolvidos no processo concluído, faz-se necessária a criação do evento. Em busca disso, é preciso colocar os valores de data e hora num formato específico aceito pelo <em>Google</em> Agenda.</p>\n<p>[mes/dia/ano][espaço][hora-+fuso]</p>\n<p>Exemplo:</p>\n<p>05/02/2021 14:00-03:00</p>\n<p>Esta data pode ser lida como 2 de maio de 2021 às 14:00h no fuso horário GMT -3 (que é o fuso horário no Brasil)</p>\n<p>Como colocar as informações em um formato específico? Para isso, novamente, cria-se mais um bloco <em>Set variable</em>. Este último bloco vai usar as variáveis horaEvento e dataEvento para criar uma nova variável com o formato adequado para o <em>Google</em>.</p>\n<p>A disposição física dos blocos deve ser idêntica à mostrada na imagem abaixo:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot35.png\" alt=\"Disposição dos blocos\"> Disposição dos blocos</p>\n<h2>FORMATANDO OS DADOS</h2>\n<p>Para que o funcionamento ocorra corretamente, o último bloco deve ser configurado desta forma:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot36.png\" alt=\"Configuração do último bloco de ferramentas\"> Configuração do último bloco de ferramentas</p>\n<p>A função <em>to string</em> converte os valores para o formato <em>string</em> e, por meio desse bloco, há a adição de um espaço e do fuso horário referente à localização atual. Por fim, ao apertar <em>OK</em>, há o salvamento em uma variável <em>toCalendar</em>.</p>\n<p>Novamente, retorne à conversa com o <em>bot</em> e observe a diferença entre os formatos da mensagem anterior à conversão e presente:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/post37.png\" alt=\"Testando a comunicação com o bot\"></p>\n<p>Há a possibilidade de inserção de novos formatos de data e horário quando houver o envio da mensagem para o <em>bot</em>.</p>\n<p>A data pode ser expressa das seguintes formas:</p>\n<ul>\n<li>ano-mes-dia: 2016-06-20</li>\n<li>ano/mes/dia: 2016/06/20</li>\n<li>mes/dia/ano: 06/20/2020</li>\n<li>dia.mes.ano: 20.06.2020</li>\n</ul>\n<p>A hora pode ser expressa de duas formas:</p>\n<ul>\n<li>hora[24h]:minuto: 17:26</li>\n<li>hora[12h]:minuto[espaço][AM/PM]: 5:26 PM</li>\n</ul>\n<p>A forma escolhida para prosseguirmos com a construção da aplicação é a seguinte:</p>\n<p>dia.mes.ano para data. hora:minuto[12h] para horário.</p>\n<p>Logo, uma forma de marcar o evento pode ser:</p>\n<p>/cortarCabelo 01.02.2021 15:00</p>\n<h2>ADICIONANDO O <em>GOOGLE CALENDAR</em></h2>\n<p>Agora, deve-se colocar o bloco que adiciona o evento no <em>Google</em> Calendar.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot38.png\" alt=\"Configurando o bloco Google Calendar\"> Configurando o bloco <em>Google Calendar</em></p>\n<p>Selecione o bloco <em>Create an Event</em> e posicione-o entre o bloco <em>Set variable</em>, onde foi criada a variável <em>toCalendar</em>, e o bloco <em>Send a text message or a Reply</em> do <em>Telegram</em>, como na imagem abaixo:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot39.png\" alt=\"Disposição dos blocos após a adição do Google Calendar\"> Disposição dos blocos após a adição do <em>Google Calendar</em></p>\n<p>Agora vamos configurar o <em>Google Calendar</em> - <em>Create an Event</em>.</p>\n<p>Após clicar nele, no campo <em>Connection</em>, pressione <em>Add</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot40.png\" alt=\"Estabelecendo a conexão entre a aplicação e a conta no gmail\"> Estabelecendo a conexão entre a aplicação e a conta no <em>gmail</em></p>\n<p>Depois de clicar em <em>Continue</em>, haverá a abertura de uma janela destinada a receber as informações da conta <em>Google</em> e conectar o Calendário <em>Google</em> ao <em>Integromat</em>.</p>\n<p>Em seguida, é necessário preencher os seguintes campos:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot41.png\" alt=\"Continuação da configuração do bloco Google Calnedar\"></p>\n<p>Em <em>Calendar ID</em>, selecione o calendário onde o evento será adicionado. Caso esse seja o primeiro calendário criado, deve-se pressionar a opção <em>Primary Calendar</em>.</p>\n<p>Em <em>Event Name</em> coloque a variável criada anteriormente nomeEvento.</p>\n<p>Em <em>Start Date</em> e <em>End Date</em> coloque a variável <em>toCalendar</em>.</p>\n<h2>AJUSTES FINAIS</h2>\n<p>Depois dessa etapa, o <em>bot</em> está pronto para uso. Apesar dele já estar funcionando normalmente, é preciso adicionar uma mensagem no último bloco de modo a garantir e certificar de que o <em>bot</em> emita um alerta de sucesso como “Evento adicionado”.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot42.png\" alt=\"Configuração do último bloco Telegram\"> Configuração da confirmação do evento</p>\n<p>Vamos ver se o evento está finalmente sendo criado agora?</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot43.png\" alt=\"Testando confirmação \"></p>\n<p>Salve a aplicação e aperte o botão <em>Run Once</em>. Feito isso, converse com o seu <em>bot</em> no <em>Telegram</em> de modo a enviar as informações do evento.</p>\n<p>Parece que funcionou, certo? Vamos observar se o evento foi criado!</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot44.png\" alt=\"Evento criado no Google Calendar\"> Evento criado no <em>Google Calendar</em></p>\n<p>Como pode ser visualizado na figura acima, o evento foi adicionado no <em>Google Calendar</em> no dia e hora em que especificados ao <em>bot</em>. A fim de que esse funcionamento permaneça de forma ininterrupta, é necessário ligar o <em>bot</em> para que ele funcione sem a necessidade de pressionar o <em>Run Once</em> a cada execução. Para isso, é preciso ligá-lo no botão-chave, localizado logo abaixo do botão <em>Run Once</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot45.png\" alt=\"Tecla de ativação do bot\"> <img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot46.png\" alt=\"Tecla de ativação do bot\"></p>\n<p>Após isso, é possível definir um nome para a integração no canto superior esquerdo, clicando sobre o nome e alterando seu valor.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot47.png\" alt=\"Renomeando a integração\"></p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot48.png\" alt=\"Renomeando a integração\"></p>\n<p>Posteriormente, salve o seu projeto para finalizar clicando no disquete na aba <em>Controls</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot49.png\" alt=\"Salvando o projeto\"> Salvando o projeto</p>\n<p>Ao receber a mensagem de confirmação, é possível retornar à página inicial e o bot criado já está funcionando. Assim, a criação de eventos no <em>Google</em> Agenda pode ocorrer pela comunicação com o <em>bot</em> pelo <em>Telegram</em>.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot50.png\" alt=\"Checagem do funcionamento\"> Checagem do funcionamento</p>\n<p>Ressalta-se que, se houver algum erro de escrita ou formatação durante a troca de mensagens com o <em>bot</em>, será necessário ativá-lo novamente no <em>Integromat</em>. Isso se deve ao fato de que, para não aumentar a complexidade da aplicação, não houve o desenvolvimento de uma possibilidade para tratar erros.</p>\n<h2>ETAPAS PARA O DESENVOLVIMENTO DA APLICAÇÃO</h2>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbot51.png\" alt=\"Resumo das etapas para o desenvolvimento do bot\"></p>\n<h2>CONCLUSÃO</h2>\n<p>A partir desse manual, o(a) leitor(a), independente do nível de conhecimentos prévios, pode compreender o que são os <em>bots</em>, bem como a capacidade desse tipo de aplicação em solucionar problemas estruturados, programáveis e parametrizados. Além disso, o(a) leitor(a) consegue desenvolver um robô virtual capaz de reduzir uma atividade mecânica para o envio de uma mensagem no chat específico.</p>\n<p>Apesar do manual inserir os robôs virtuais em um contexto específico (adicionar eventos na <em>Google</em> Agenda), o procedimento para construir outros <em>bots</em>, que possam exercer funções distintas, segue as mesmas diretrizes apresentadas quando se faz uso de uma integração entre o <em>Integromat</em> e o <em>Telegram</em>.</p>\n<p>Por fim, não se esqueça de comentar sobre nossa publicação, colocar as suas dúvidas e nos trazer sugestões para <em>posts</em> futuros.</p>\n<h2>REFERÊNCIAS</h2>\n<p>[GUIA Completo] Chatbot: o que é, como funciona, benefícios e cases. [S. l.], 30 out. 2019. Disponível em: <a href=\"https://take.net/blog/chatbots/chatbot\">https://take.net/blog/chatbots/chatbot</a>. Acesso em: 1 fev. 2021.</p>\n<p>Tutorials | Integromat. [S. l.], 2012. Disponível em: <a href=\"https://www.integromat.com/en/kb/tutorials.html\">https://www.integromat.com/en/kb/tutorials.html</a>. Acesso em: 1 fev. 2021.</p>\n<p>Telegram API. [S. l.], 2013. Disponível em: <a href=\"https://core.telegram.org/api\">https://core.telegram.org/api</a>. Acesso em: 1 fev. 2021.</p>\n","image":"/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots/images/postbotcapa.jpg","link":"/corrente-alternativa/2021-02-09-tutorial-para-desenvolvimento-de-bots","date":"2021-02-09","title":"Tutorial para desenvolvimento de bots","authors":["brenoAmin","mauricioTaffarel","rafaelShort"]}},"__N_SSG":true}