{"pageProps":{"postData":{"id":"2021-07-27-dia-nacional-de-prevencao-ao-acidente-no-trabalho","contentHtml":"<p>Segundo o Instituto Brasileiro de Geografia e Estatística (IBGE), foi constatado que o Brasil, em 2020, possuía 30,6 milhões de trabalhadores com carteira assinada. Nas suas rotinas de trabalho, esses empregados formais estão frequentemente sujeitos a acidentes, assim como aqueles que não apresentam carteira assinada.</p>\n<p>Olhando o <a href=\"https://bc.pressmatrix.com/pt-BR/profiles/1227998e328d/editions/eb4f7f53ec03ef6991cf\"><strong>Anuário Brasileiro de Proteção de 2020</strong></a>, que analisa dados a respeito de saúde e segurança do trabalho no mundo, é notado que o Brasil ocupa a 3° posição mundial no ranking de número absoluto de mortes por acidente de trabalho. Além disso, encontra-se na 5° posição no que tange a acidentes não fatais no mundo, com o número absoluto de 549.405 de acidentes. Apesar desses dados serem alarmantes, deve ser ressaltado que o Brasil possui uma das maiores populações do mundo, acima de 213 milhões de habitantes (fonte: IBGE), aumentando o número de indivíduos expostos a esses acontecimentos. Por isso, quando se analisa a quantidade de acidentes por 100.000 trabalhadores, a posição brasileira cai para 43° no ranking mundial. Contudo, ainda se tem um número enorme de pessoas acidentadas e mortas no país.</p>\n<p>Por isso, refletir sobre as condições de trabalho a que são submetidas essas pessoas e lutar pela melhoria desse ambiente é um dever de todos. A fim de promover essa conscientização, no dia 27 de julho, comemora-se o Dia Nacional da Prevenção de Acidentes de Trabalho.</p>\n<h2>História</h2>\n<p>A presença dessa data no calendário comemorativo demonstra a preocupação com as condições dos trabalhadores do país. Essa medida foi adotada num período onde havia um índice de acidentes laborais muito elevado para a época. Por causa disso, o Banco Mundial anunciou que cortaria os financiamentos para o país caso o panorama não fosse alterado. Com isso, o ministro Júlio Barata publicou portarias que exigiam que serviços de medicina e segurança do trabalho fossem adotados nas empresas. Então, em 27 de julho de 1972, foi determinado que as empresas com mais de 100 funcionários deveriam ter o Serviço Obrigatório de Segurança e Medicina no Trabalho. Por conseguinte, houve a garantia de uma série de procedimentos padrões que visavam a manutenção do ambiente e das atividades, com a finalidade de resguardar as pessoas.</p>\n<h2>Normas Regulamentadoras</h2>\n<p>Os anos se passaram desde 1972, e novas conquistas garantiram que as condições do trabalho melhorassem gradativamente. Um dos principais exemplos são as Normas Regulamentadoras. Segundo o site do Governo Federal <em>“As Normas Regulamentadoras (NR) são disposições complementares ao Capítulo V (Da Segurança e da Medicina do Trabalho) do Título II da</em> <a href=\"http://www.planalto.gov.br/ccivil_03/decreto-lei/del5452.htm\"><strong>Consolidação das Leis do Trabalho (CLT)</strong></a><em>, com redação dada pela</em> <strong><a href=\"http://www.planalto.gov.br/ccivil_03/LEIS/L6514.htm\">Lei nº 6.514</a>,</strong> de 22 de dezembro de 1977_.”_</p>\n<p>As NRs prevêem obrigações e direitos que devem ser cumpridos, tanto por empregadores quanto pelos empregados, objetivando garantir a execução de um trabalho pleno e seguro e evitando condições precárias que possam gerar doenças e acidentes no trabalho.</p>\n<p>Atualmente, existem 36 NRs vigentes no país, as quais são elaboradas e atualizadas pela Secretaria Especial de Previdência e Trabalho. Essas normas estão listadas abaixo:</p>\n<ul>\n<li>NR-1 - DISPOSIÇÕES GERAIS</li>\n<li>NR-2 - INSPEÇÃO PRÉVIA (REVOGADA)</li>\n<li>NR-3 - EMBARGO OU INTERDIÇÃO</li>\n<li>NR-4 - SERVIÇOS ESPECIALIZADOS EM ENGENHARIA DE SEGURANÇA E EM MEDICINA DO TRABALHO</li>\n<li>NR-5 - COMISSÃO INTERNA DE PREVENÇÃO DE ACIDENTES</li>\n<li>NR-6 - EQUIPAMENTO DE PROTEÇÃO INDIVIDUAL - EPI</li>\n<li>NR-7 - PROGRAMA DE CONTROLE MÉDICO DE SAÚDE OCUPACIONAL</li>\n<li>NR-8 - EDIFICAÇÕES</li>\n<li>NR-9 - PROGRAMA DE PREVENÇÃO DE RISCOS AMBIENTAIS</li>\n<li>NR-10 - SEGURANÇA EM INSTALAÇÕES E SERVIÇOS EM ELETRICIDADE</li>\n<li>NR-11 - TRANSPORTE, MOVIMENTAÇÃO, ARMAZENAGEM E MANUSEIO DE MATERIAIS</li>\n<li>NR-12 - SEGURANÇA NO TRABALHO EM MÁQUINAS E EQUIPAMENTOS</li>\n<li>NR-13 - CALDEIRAS, VASOS DE PRESSÃO E TUBULAÇÕES E TANQUES METÁLICOS DE ARMAZENAMENTO</li>\n<li>NR-14 - FORNOS</li>\n<li>NR-15 - ATIVIDADES E OPERAÇÕES INSALUBRES</li>\n<li>NR-16 - ATIVIDADES E OPERAÇÕES PERIGOSAS</li>\n<li>NR-17 - ERGONOMIA</li>\n<li>NR-18 - CONDIÇÕES E MEIO AMBIENTE DE TRABALHO NA INDÚSTRIA DA CONSTRUÇÃO</li>\n<li>NR-19 - EXPLOSIVOS</li>\n<li>NR-20 - SEGURANÇA E SAÚDE NO TRABALHO COM INFLAMÁVEIS E COMBUSTÍVEIS</li>\n<li>NR-21 - TRABALHOS A CÉU ABERTO</li>\n<li>NR-22 - SEGURANÇA E SAÚDE OCUPACIONAL NA MINERAÇÃO</li>\n<li>NR-23 - PROTEÇÃO CONTRA INCÊNDIOS</li>\n<li>NR-24 - CONDIÇÕES SANITÁRIAS E DE CONFORTO NOS LOCAIS DE TRABALHO</li>\n<li>NR-25 - RESÍDUOS INDUSTRIAIS</li>\n<li>NR-26 - SINALIZAÇÃO DE SEGURANÇA</li>\n<li>NR-27 - REGISTRO PROFISSIONAL DO TÉCNICO DE SEGURANÇA DO TRABALHO (REVOGADA)</li>\n<li>NR-28 - FISCALIZAÇÃO E PENALIDADES</li>\n<li>NR-29 - NORMA REGULAMENTADORA DE SEGURANÇA E SAÚDE NO TRABALHO PORTUÁRIO</li>\n<li>NR-30 - SEGURANÇA E SAÚDE NO TRABALHO AQUAVIÁRIO</li>\n<li>NR-31 - SEGURANÇA E SAÚDE NO TRABALHO NA AGRICULTURA, PECUÁRIA SILVICULTURA, EXPLORAÇÃO FLORESTAL E AQUICULTURA</li>\n<li>NR-32 - SEGURANÇA E SAÚDE NO TRABALHO EM SERVIÇOS DE SAÚDE</li>\n<li>NR-33 - SEGURANÇA E SAÚDE NOS TRABALHOS EM ESPAÇOS CONFINADOS</li>\n<li>NR-34 - CONDIÇÕES E MEIO AMBIENTE DE TRABALHO NA INDÚSTRIA DA CONSTRUÇÃO, REPARAÇÃO E DESMONTE NAVAL</li>\n<li>NR-35 - TRABALHO EM ALTURA</li>\n<li>NR-36 - SEGURANÇA E SAÚDE NO TRABALHO EM EMPRESAS DE ABATE E PROCESSAMENTO DE CARNES E DERIVADOS</li>\n<li>NR-37 - SEGURANÇA E SAÚDE EM PLATAFORMAS DE PETRÓLEO</li>\n</ul>\n<h2>NR 10 - Instalações e Serviços de Eletricidade</h2>\n<p>Como apresentado acima, cada Norma Regulamentadora estabelece condições de trabalho para áreas específicas, sendo a NR 10 destinada para Instalações e Serviços de Eletricidade. Segundo o site do Governo Federal, esse conjunto de obrigações tem como objetivo resguardar todos os envolvidos com o trabalho em <em>“instalações elétricas, em seu projeto, execução, reforma, ampliação, operação e manutenção, bem como segurança de usuários e terceiros”</em>. Nas disposições da norma são abordado diversas padronizações, sendo as principais delas:</p>\n<ul>\n<li>\n<p><strong>Medidas de Controle:</strong> São atividades que tem como objetivo o controle prévio de risco elétrico nas ações que envolvem intervenções nas instalações elétricas.</p>\n</li>\n<li>\n<p><strong>Medidas de Proteção Coletiva:</strong> São os procedimentos obrigatórios que são adotados para proteção coletiva dos trabalhadores que estão envolvidos diretamente, ou não, com o trabalho em eletricidade.</p>\n</li>\n<li>\n<p><strong>Medidas de Proteção Individual:</strong> Neste tópico são indicados os métodos de proteção individual para os trabalhadores envolvidos com eletricidade. Essas medidas são adotadas quando as ações coletivas não são suficientes para controlar os riscos.</p>\n</li>\n<li>\n<p><strong>Segurança em Projetos:</strong> Os projetos elétricos das instalações, segundo a NR 10, devem seguir um padrão técnico a fim de garantir a segurança em casos de manutenção e intervenções.</p>\n</li>\n<li>\n<p><strong>Segurança em Instalações Elétricas Desenergizadas:</strong> A NR- 10 neste tópico, define quais condições necessárias para a desenergização de uma instalação quando devem ser executadas intervenções sobre elas.</p>\n</li>\n<li>\n<p><strong>Segurança em Instalações Elétricas Energizadas:</strong> Aqui, são previstos quais condições são necessárias para uma instalação estar energizada, quem está capacitado para realizar intervenção e sob quais circunstâncias é possível atuar sobre uma instalação.</p>\n</li>\n<li>\n<p><strong>Proteção Contra Incêndio e Explosão:</strong> Os locais que possuírem instalações ou equipamentos elétricos devem possuir medidas de segurança contra proteção a incêndio</p>\n</li>\n<li>\n<p><strong>Sinalização de Segurança:</strong> Os locais com instalações elétricas devem possuir sinalização que sejam adequadas para a segurança das pessoas.</p>\n</li>\n</ul>\n<p>Essas disposições, quando analisadas na própria NR-10, possuem diversos detalhes. Por isso, o Ministério do Trabalho torna obrigatório que os profissionais que tenham contato com baixa e/ou média tensão estejam devidamente habilitados em um curso básico dessa norma.</p>\n<h2>Referências</h2>\n<p>SECRETARIA DE TRABALHO. <strong>Normas Regulamentadoras - NR</strong>. [S. l.], 2021. Disponível em: <a href=\"https://www.gov.br/trabalho/pt-br/inspecao/seguranca-e-saude-no-trabalho/ctpp-nrs/normas-regulamentadoras-nrs\">https://www.gov.br/trabalho/pt-br/inspecao/seguranca-e-saude-no-trabalho/ctpp-nrs/normas-regulamentadoras-nrs</a>. Acesso em: 21 jul. 2021.</p>\n<p>ANUÁRIO Brasileiro de Proteção 2020. <strong>Revista Proteção Digital</strong>, [<em>s. l.</em>], 2020. Disponível em: <a href=\"https://bc.pressmatrix.com/pt-BR/profiles/1227998e328d/editions/eb4f7f53ec03ef6991cf/pages\">https://bc.pressmatrix.com/pt-BR/profiles/1227998e328d/editions/eb4f7f53ec03ef6991cf/pages</a>. Acesso em: 21 jul. 2021.</p>\n<p>ANAMT. <strong>27 de julho: Dia Nacional da Prevenção ao Acidente de Trabalho</strong>. [<em>S. l.</em>], 2020. Disponível em: <a href=\"https://www.anamt.org.br/portal/2020/07/27/27-de-julho-dia-nacional-da-prevencao-ao-ac-de-2020/\">https://www.anamt.org.br/portal/2020/07/27/27-de-julho-dia-nacional-da-prevencao-ao-ac-de-2020/</a>. Acesso em: 21 jul. 2021.</p>\n<p>SECRETARIA DE TRABALHO. <strong>Norma Regulamentadora No. 10 (NR-10)</strong>. In: SECRETARIA DO TRABALHO (org.). Norma Regulamentadora No. 10 (NR-10). [S. l.], 2021. Disponível em: <a href=\"https://www.gov.br/trabalho/pt-br/inspecao/seguranca-e-saude-no-trabalho/ctpp-nrs/norma-regulamentadora-no-10-nr-10\">https://www.gov.br/trabalho/pt-br/inspecao/seguranca-e-saude-no-trabalho/ctpp-nrs/norma-regulamentadora-no-10-nr-10</a>. Acesso em: 22 jul. 2021.</p>\n<p>INSTITUTO BRASILEIRO DE GEOGRAFIA E ESTATÍSTICA. <strong>Projeção Populacional</strong>. In: INSTITUTO BRASILEIRO DE GEOGRAFIA E ESTATÍSTICA. Projeção Populacional do Brasil. [S. l.], 2021. Disponível em: <a href=\"https://www.ibge.gov.br/apps/populacao/projecao/box%5C_popclock.php\">https://www.ibge.gov.br/apps/populacao/projecao/box\\_popclock.php</a>. Acesso em: 25 jul. 2021.</p>\n","image":"/corrente-alternativa/2021-07-27-dia-nacional-de-prevencao-ao-acidente-no-trabalho/images/post_ca_seguranca.jpg","link":"/corrente-alternativa/2021-07-27-dia-nacional-de-prevencao-ao-acidente-no-trabalho","date":"2021-07-27","title":"Dia Nacional de Prevenção ao Acidente no Trabalho","authors":["rafaelShort"]}},"__N_SSG":true}