{"pageProps":{"postData":{"id":"2021-03-31-seguranca-da-informacao","contentHtml":"<p>A Engenharia Social consiste na capacidade de obtenção dos dados e informações confidenciais através de falhas associadas ao sistema ou ao desconhecimento de práticas que possam favorecer à navegação segura do usuário. Essa prática ilegal já existia nos tempos em que as tecnologias ainda não estavam tão presentes no cotidiano da maioria das pessoas. Assim, muitos golpes podiam ocorrer através de ligações de falsos atendentes, exigindo o fornecimento de informações pessoais, como senhas bancárias.  Com o crescimento das redes sociais e de sistemas envolvendo transações financeiras, os ataques dos cibercriminosos também se tornaram mais recorrentes. A segurança da informação busca evitar esse roubo de dados além dos danos aos equipamentos e <em>softwares</em> associados.</p>\n<h2>Princípios de segurança</h2>\n<p>O principal objetivo da segurança da informação é promover a confiabilidade. Além disso, há ainda os seguintes princípios de segurança:</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg1.png\" alt=\"Esquema mostrando os princípios de segurança.\"></p>\n<p>Princípios da segurança da informação</p>\n<h3><strong>Disponibilidade</strong></h3>\n<p>A garantia de que as informações sempre possam ser acessadas pelos usuários autorizados depende que o sistema esteja disponível para uso. Para isso, algumas alternativas podem ser usadas, como o <em>nobreak</em> o qual regula a voltagem evitando danos se houver picos energéticos e alimenta o circuito em caso de queda de energia e o <em>backup</em> que permite a recuperação de dados a partir da cópia de arquivos. Além disso, é importante se atentar para a validade do hardware, fazendo as devidas substituições quando necessário. Tais equipamentos substitutos estão inclusos no grupo do <em>backup</em> físico</p>\n<h4><strong>Integridade</strong></h4>\n<p>Esse princípio visa garantir que as informações não sejam modificadas e se faz presente a partir do uso de senha, biometria, assinatura e certificado digital.</p>\n<h4><strong>Autenticidade</strong></h4>\n<p>Busca certificar que a informação enviada tenha uma origem conhecida. Isso pode ser garantido através de senha, biometria, assinatura e certificado digital.</p>\n<h4><strong>Confidencialidade</strong></h4>\n<p>Evita que a informação enviada seja lida por terceiros, refere-se à privacidade do conteúdo. Essa propriedade pode ser garantida por meio da criptografia.</p>\n<h4><strong>Irretratabilidade</strong></h4>\n<p>Garante que um transmissor não pode negar o envio de uma informação, assim como um receptor não pode negar seu recebimento.</p>\n<h2>Políticas de segurança</h2>\n<p>Documentação de cumprimento obrigatório pelos membros da empresa a qual apresenta os aspectos que garantem a segurança da organização. Estes estão subdivididos em:</p>\n<h3><strong>Acesso físico</strong></h3>\n<p>Referente à segurança física da empresa e de seus sistemas, a exemplo dos extintores de incêndio, câmeras de segurança, acesso ao_data center_, entre outros.</p>\n<h3><strong>Acesso lógico</strong></h3>\n<p>Associa-se às propriedades lógicas do sistema, responsável pela segurança do <em>software</em>, como o antivírus e o <em>firewall</em>. Ou seja, percebe-se que uma opção segura para prevenção contra os <em>malwares</em> é ter ambos operando em conjunto.</p>\n<h4><strong>Rastreadores de acesso</strong></h4>\n<p>Indica o monitoramento parcial ou total do acesso dos colaboradores da empresa aos sistemas da organização, estabelecendo restrições de uso para determinadas informações e sites, por exemplo. Ressalta-se que esse monitoramento não é considerado ilegal se estiver previsto na política de segurança da organização.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg8.jpg\" alt=\"Data center\"></p>\n<p><em>Data center.</em></p>\n<h2>Ferramentas de proteção</h2>\n<h3><strong>Antivírus</strong></h3>\n<p>Trata-se de uma ferramenta que permite o rastreamento e o combate às principais pragas virtuais, conhecidas como <em>malwares</em>. Ou seja, apesar do que seu nome indica, os antivírus não protegem a máquina somente contra os vírus. Ao realizar a sua instalação, um banco de dados é criado dentro do qual há o cadastro de um certo número de pragas virtuais, somente ocorrerá a detecção desses <em>softwares</em> malignos catalogados. Normalmente, com a atualização do programa, o catálogo é aumentado e mais códigos maliciosos podem ser combatidos, aumentando a segurança do sistema.</p>\n<p>A detecção de <em>malwares</em> é feita a partir da análise comportamental do sistema. Desse modo, ao executar um arquivo, o antivírus faz uma análise da sua rotina e, caso detecte que seu comportamento está diferente do esperado, há o bloqueio de sua execução e de sua propagação pelo computador.</p>\n<h3><strong><em>Firewall</em></strong></h3>\n<p>O <em>firewall</em> é um mecanismo que contribui para a proteção do computador e controla a entrada e saída de pacotes IP, TCP e UDP da rede. Seu funcionamento se dá por meio da atribuição de especificações capazes de filtrar pacotes e bloquear tentativas de acessos não autorizados. A partir do estabelecimento dessas regras, o <em>firewall</em> é capaz de barrar a entrada de <em>malwares</em>, mas não é responsável por sua eliminação em caso de entrada na máquina.</p>\n<p>Com isso, o <em>firewall</em> não deve ser confundido com o antivírus uma vez que ele não consegue detectar e combater um software maligno diretamente. Porém, um <em>firewall</em> pode impedir a entrada de uma praga virtual de maneira indireta, evitando a entrada de um arquivo que esteja infectado caso esse se encaixe nas regras estabelecidas para a filtragem. A configuração mais indicada para essa ferramenta consiste no bloqueio do conteúdo de entrada e liberação de conexões específicas de saída.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg2.png\" alt=\"Antivírus e firewall\"></p>\n<p>Ferramentas de proteção</p>\n<h2><em>Malwares</em></h2>\n<h3><strong>Vírus</strong></h3>\n<p>O vírus é a parte de um programa presente em algum dispositivo (computadores, celulares, notebooks), normalmente malicioso, que se propaga pela inserção de auto-cópias, tornando-se parte de outros <em>softwares</em> e arquivos hospedeiros. Como consequência, quando ocorre a execução do arquivo infectado, o código do vírus também inicia sua disseminação através da máquina. Um vírus é capaz de apagar dados, promover travamentos, tornar a máquina lenta, apresentar avisos indesejados, transformar os arquivos em atalhos, entre outros. Para combatê-lo, é necessário que o antivírus instalado consiga fazer seu reconhecimento a partir do banco de dados disponível.</p>\n<h3><strong><em>Worm</em></strong></h3>\n<p>Consiste em um <em>malware</em> capaz de se propagar automaticamente pelas redes, enviando auto-cópias entre computadores. Seus objetivos são parecidos com os dos vírus, por exemplo: danificar a máquina, prejudicar o uso de algumas funcionalidades, entre outros. Uma das principais características que permitem sua distinção com os vírus reside no fato de que essa praga virtual é classificada como autossuficiente, enquanto o vírus não apresenta essa propriedade. Ou seja, o <em>worm</em> pode ser percebido na máquina de maneira direta e normalmente se apresenta como um arquivo executável suspeito. Por outro lado, um vírus depende de um hospedeiro para ser enxergado.</p>\n<p>É importante ressaltar que um <em>worm</em> não contamina arquivos executáveis ou programas do computador. Como esse <em>malware</em> já consiste em um arquivo desse tipo, ele realiza a infecção do sistema operacional ou da rede do computador. Isso é feito a partir da autorreplicação do arquivo e de sua sucessiva reprodução até promover o travamento do sistema pelo excesso de execuções.</p>\n<h3><strong><em>Bot</em></strong></h3>\n<p>O <em>bot</em> é uma praga virtual que dispõe de mecanismos que possibilitam a comunicação contínua com o invasor e permitem, com isso, o controle remoto das ações do programa maligno. Esse código malicioso é frequentemente usado em ataques e possui um processo de infecção similar ao <em>worm</em>, capaz de se propagar automaticamente, aproveitando as vulnerabilidades presentes nos <em>softwares</em> instalados.</p>\n<h3><strong><em>Trojan</em></strong> <strong>ou Cavalo de Tróia</strong></h3>\n<p>O <em>trojan</em> é um programa disfarçado que pode ser introduzido em um computador para assumir o controle do sistema. Inicialmente, ele costuma desativar os sistemas de proteção da máquina, como o <em>firewall</em> e o antivírus. Após tal vulnerabilidade, o responsável pelo <em>malware</em> pode se conectar com o computador e ter acesso total a seus recursos. A contaminação por <em>trojans</em> pode ser prevenida, evitando-se a conexão de <em>pen-drives</em> em computadores de uso público, como os de uma <em>lan-house</em>, e a instalação de <em>softwares</em> pirateados.</p>\n<h3><strong><em>Backdoor</em></strong></h3>\n<p>O backdoor é um praga virtual que permite o retorno do invasor a um computador infectado a partir da inclusão ou mudança de funcionalidades. Dessa forma, ocorre a habilitação de serviços que permitem a entrada do atacante novamente, o qual se aproveita sobretudo de sistemas operacionais desatualizados.</p>\n<h3><strong><em>Spyware</em></strong></h3>\n<p>Antes de tratar sobre o <em>spyware</em>, é importante explicar o conceito de <em>cookies</em>. Quando um usuário acessa um site, há o armazenamento de um arquivo chamado de <em>cookies</em>. Ao fechar o navegador, esse <em>cookie</em> é salvo na máquina como arquivo temporário e, em caso de retorno ao site, o servidor recarrega o <em>cookie</em>, reconhecendo o perfil do internauta. Aproveitando-se disso, o <em>spyware</em> é um programa que monitora as atividades de um sistema e envia as informações adquiridas ilegalmente para terceiros e para o criador desse <em>software</em> maligno. Portanto, é possível que haja o envio de propagandas referentes aos <em>cookies</em> para preenchimento de formulários e, por conseguinte, o roubo dos dados pessoais do usuário.</p>\n<h3><strong><em>Keylogger</em></strong> <strong>e</strong> <strong><em>screenlogger</em></strong></h3>\n<p>O <em>keylogger</em> é um <em>malware</em> capaz de capturar, armazenar as teclas digitadas pelo usuário no teclado do computador e enviá-las para o criador da praga virtual. Esse recurso normalmente é usado para a obtenção de senhas enquanto os internautas navegam por sites de comércio eletrônico ou internet <em>banking</em>. Após os ataques através do <em>keylogger</em> se tornarem cada vez mais frequentes, muitos sites de comércio online começaram a fazer uso de um teclado virtual mostrado na tela onde a senha é inserida a partir dos cliques com o mouse. Porém, foi desenvolvida uma forma de vulnerabilizar esse sistema através do <em>screenlogger</em>, capaz de armazenar através de <em>prints</em> na tela a posição do cursor e a tela apresentada quando o mouse é clicado e enviar as imagens para o dono desse <em>malware</em>; obtendo, com isso, a senha do usuário. Outra praga virtual análoga é o <em>weblogger, o</em> qual permite que o <em>cracker</em> acesse a <em>webcam</em> do computador e possa filmar o conteúdo exibido, invadindo a privacidade do usuário.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg6.png\" alt=\"Teclado virtual do banco para colocar senha.\"></p>\n<p>Teclado virtual</p>\n<h3><strong><em>Adware</em></strong></h3>\n<p>O <em>adware</em> tem seu funcionamento dependente do processo de espionagem, pois foi projetado para exibir propagandas direcionadas conforme a navegação do usuário sem que ele possa consentir a respeito de tal monitoramento. Normalmente, essas propagandas são mostradas através de janelas <em>pop-up</em> maliciosas as quais conduzem o usuário até uma praga virtual. Ressalta-se que as propagandas nem sempre são criminosas uma vez que os anúncios incorporados a programas como patrocínio ou referente ao retorno financeiro de aplicativos gratuitos são permitidas legalmente.</p>\n<h3><em><strong>Hijacker</strong></em></h3>\n<p>O <em>hijacker</em> atua nos navegadores com a modificação da página inicial e a sua barra de ferramentas, pelo impedimento do acesso aos sites de antivírus e forçando o usuário a visitar páginas indesejadas a fim de promover tráfego e publicidade. Ele costuma se instalar de modo furtivo nos computadores a partir de <em>softwares</em> de origem suspeita.</p>\n<h3><strong><em>Rootkit</em></strong></h3>\n<p>O <em>rootkit</em> pode ser definido como um conjunto de <em>softwares</em> e técnicas que permite esconder e assegurar a presença de um invasor ou código suspeito em um computador comprometido. Pode ser usado para instalar programas maliciosos, como o <em>backdoor</em>, assegurando o acesso futuro à máquina, para esconder atividades e informações, arquivos, diretórios, processos, chaves de registro, conexões de rede, entre outros. Esse apagamento de arquivos inclui relatórios gerados pelo servidor com a intenção de dificultar a detecção desse <em>malware</em>.</p>\n<p>O <em>backdoor</em> e o <em>rootkit</em> são inseridos por um <em>cracker</em> através da execução de um programa malicioso, exploram as vulnerabilidades da máquina e criam condições para o retorno do criminoso. Porém, apesar das semelhanças, somente o <em>rootkit</em> altera e remove arquivos e promove a instalação de outros <em>softwares</em> ou arquivos de procedência duvidosa.</p>\n<h3><strong><em>Ransomware</em></strong></h3>\n<p>O <em>ransomware</em> é um código malicioso que remove o acesso aos dados armazenados em uma máquina. Para isso, ele normalmente criptografa a maioria (ou todos) os arquivos do computador e exige a realização de um pagamento para que o usuário possa recuperar o acesso. Uma importante maneira de prevenção contra esse <em>malware</em> consiste em fazer atualizações frequentes no <em>backup</em>, sobretudo dos arquivos mais relevantes.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg7.jpg\" alt=\"Tipos de pragas virtuais.\"></p>\n<p>Tipos de <em>Malwares</em></p>\n<h2>Golpes e ataques virtuais</h2>\n<h3><strong><em>Phishing</em></strong></h3>\n<p>O <em>phishing</em> é um tipo de golpe virtual onde o cracker busca obter dados pessoais e financeiros pelo uso combinado de meios técnicos e engenharia social. Esse processo ocorre através de propagandas, e-mails, sites falsos que são usados para atrair o usuário vítima a fim de que haja o fornecimento de suas informações pessoais.</p>\n<h3><strong><em>Pharming</em></strong></h3>\n<p>O <em>pharming</em> pode ser considerado um tipo específico de <em>phishing</em> envolvendo o direcionamento da navegação do usuário para sites falsos por meio de alterações no serviço de Sistema Nome de Domínio (DNS). Desse modo, quando a vítima tentar o acesso a um site, a navegação será redirecionada imperceptivelmente para uma página falsa. Assim, nesse ambiente clonado, haverá a requisição e roubo dos dados pessoais do usuário.</p>\n<h3><em><strong>DOS</strong></em></h3>\n<p>A técnica <em>DOS</em> se baseia na negação de um serviço e ocorre quando um atacante usa uma máquina para tirar de operação um serviço, um computador ou uma rede conectada à internet. Quando esse ataque é feito de forma coordenada e distribuída ao longo de um conjunto de computadores, trata-se de do <em>DDOS</em>. Esse consiste no ataque simultâneo por muitas máquinas sobre controle do invasor.</p>\n<p><img src=\"http://localhost:3000/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg4.jpg\" alt=\"Golpes e ataques virtuais.\"></p>\n<p>Golpes e ataques virtuais</p>\n<h2>Conclusão</h2>\n<p>Portanto, é perceptível a importância da preocupação com a segurança de dados a nível individual e coletivo. Em busca dessa garantia, algumas práticas devem ser evitadas pelos usuários durante sua navegação. A exemplo delas: o acesso a páginas classificadas como não seguras, o <em>download</em> de programas pirateados e de procedência duvidosa e o fornecimento de dados pessoais para sites sem certificação digital. Ademais, é de suma importância que o usuário mantenha o <em>firewall</em> de sua máquina com as configurações recomendadas e o seu antivírus atualizado para se prevenir da contaminação por <em>malwares</em> e dos golpes e ataques virtuais.</p>\n<h2>Referências</h2>\n<p>GRAN cursos Online. <em>In</em>: <strong>Gran cursos Online</strong>. [<em>S. l.</em>], 2018. Disponível em: <a href=\"https://www.grancursosonline.com.br/\">https://www.grancursosonline.com.br/</a>. Acesso em: 5 fev. 2021.</p>\n<p>A ENGENHARIA para enganar pessoas. [<em>S. l.</em>], 23 dez. 2013. Disponível em: <a href=\"https://www.kaspersky.com.br/blog/engenharia-social-hackeando-humanos/1845/\">https://www.kaspersky.com.br/blog/engenharia-social-hackeando-humanos/1845/</a>. Acesso em: 23 mar. 2021.</p>\n","image":"/corrente-alternativa/2021-03-31-seguranca-da-informacao/images/seg0.jpg","link":"/corrente-alternativa/2021-03-31-seguranca-da-informacao","date":"2021-03-31","title":"Segurança da Informação","authors":["rafaelShort"]}},"__N_SSG":true}